# -*- ii: y; -*-
#+TITLE: Lightning Fast Tilt Frontend Development
#+AUTHOR: Zach Mandeville

** Tiltfile
   The tiltfile in the frontend demo is written as so:
   #+NAME: frontend demo tilt file
   #+begin_src shell :results code drawer
  cat ~/Projects/tilt-frontend-demo/Tiltfile 
   #+end_src

   #+RESULTS: frontend demo tilt file
   :results:
   repo = local_git_repo('.')

   k8s_yaml('serve.yaml')

   # Start with a base Dockerfile with none of our source code,
   # and an entry point that starts a server.

   docker_build('tilt-frontend-demo', '.',
     live_update=[
       # when package.json changes, we need to do a full build
       fall_back_on(['package.json', 'package-lock.json']),
       # Map the local source code into the container under /src
       sync('.', '/src'),
     ])

   k8s_resource('tilt-frontend-demo', port_forwards=3000)
   :end:
   
  Seems simple and straightforward! 
** Forward Ports 
   When we tilt up, it creates a service accessible at localhost:3000, but this is local to the tilt-frontend-demo pod.  We need to port forward from our machine to that pod in the cluster to be able to view the demo on our browser.

However, I am doing this work on a remote machine, so I will also need to portforward from my local machine to the remote.

First we get our pods

  #+begin_src shell
 kubectl get pods | grep tilt
  #+end_src

  #+RESULTS:
  #+begin_example
  tilt-frontend-demo-564b6478c8-fcjz7   1/1     Running   0          9m19s
  #+end_example
  
  We'll copy that pod name, and then in the remote machine portforwward using kubectl
  
  #+NOTE: this should not be executed in the org file, but copied and run on my machine
  #+begin_example shell
  kubectl port-forward pods/tilt-frontend-demo-564b6478c8-fcjz7 3000:3000 
  #+end_example
  
  Now I can access the service on my remote machine.  If I port forward from my local machine to my remote:
  #+begin_example shell
  ssh -L 127.0.0.1:3000:localhost:3000 work -N -v 
  #+end_example
  I can access the react site on my local-est of local browsers.
